{
  "movies": [
    {
      "id": "1",
      "name": "Barbie",
      "synopsis": "No fabuloso live-action da boneca mais famosa do mundo, acompanhamos o dia a dia em Barbieland - o mundo mágico das Barbies, onde todas as versões da boneca vivem em completa harmonia e suas únicas preocupações são encontrar as melhores roupas para passear com as amigas e curtir intermináveis festas. Porém, uma das bonecas (interpretada por Margot Robbie) começa a perceber que talvez sua vida não seja tão perfeita assim, questionando-se sobre o sentido de sua existência e alarmando suas companheiras. Logo, sua vida no mundo cor-de-rosa começa a mudar e, eventualmente, ela sai de Barbieland. Forçada a viver no mundo real, Barbie precisa lutar com as dificuldades de não ser mais apenas uma boneca - pelo menos ela está acompanhada de seu fiel e amado Ken (Ryan Gosling), que parece cada vez mais fascinado pela vida no novo mundo. Enquanto isso, Barbie tem dificuldades para se ajustar, e precisa enfrentar vários momentos nada coloridos até descobrir que a verdadeira beleza está no interior de cada um.",
      "trailerUrl": "https://www.youtube.com/watch?v=Ujs1Ud7k49M",
      "imageUrl": "https://sm.ign.com/ign_br/gallery/b/barbie-mov/barbie-movie-character-posters_bc3e.jpg",
      "minutes": 115,
      "rating": 4.5,
      "favorite": true
    },
    {
      "id": "2",
      "name": "Oppenheimer",
      "synopsis": "Oppenheimer é um filme histórico de drama dirigido por Christopher Nolan e baseado no livro biográfico vencedor do Prêmio Pulitzer, Prometeu Americano: O Triunfo e a Tragédia de J. Robert Oppenheimer, escrito por Kai Bird e Martin J. Sherwin. Ambientado na Segunda Guerra Mundial, o longa acompanha a vida de J. Robert Oppenheimer (Cillian Murphy), físico teórico da Universidade da Califórnia e diretor do Laboratório de Los Alamos durante o Projeto Manhattan - que tinha a missão de projetar e construir as primeiras bombas atômicas. A trama acompanha o físico e um grupo formado por outros cientistas ao longo do processo de desenvolvimento da arma nuclear que foi responsável pelas tragédias nas cidades de Hiroshima e Nagasaki, no Japão, em 1945. Além de Cillian, o elenco também traz nomes como Emily Blunt, Matt Damon, Robert Downey Jr., Florence Pugh, Gary Oldman, Jack Quaid, Gustaf Skarsgård, Rami Malek e Kenneth Branagh.",
      "imageUrl": "https://br.web.img3.acsta.net/c_310_420/pictures/23/05/08/10/29/0695770.jpg",
      "trailerUrl": "https://www.youtube.com/watch?v=kEGlCYF5gaU",
      "minutes": 181,
      "rating": 4.4,
      "favorite": false
    },
    {
      "id": "3",
      "name": "O jogo da imitação",
      "synopsis": "Durante a segunda guerra mundial, um inglês gênio da matemática tenta decifrar o código alemão Enigma com a ajuda de seus colegas.",
      "imageUrl": "https://m.media-amazon.com/images/M/MV5BNjI3NjY1Mjg3MV5BMl5BanBnXkFtZTgwMzk5MDQ3MjE@._V1_FMjpg_UX1000_.jpg",
      "trailerUrl": "https://www.youtube.com/embed/YIkKbMcJL_4",
      "minutes": 114,
      "rating": 4.8,
      "favorite": true
    },
    {
      "id": "4",
      "name": "O menu",
      "synopsis": "Em O Menu, a jovem Margot (Anya Taylor-Joy) é convidada por Tyler (Nicholas Hoult) para viver uma experiência inesquecível em um dos restaurantes mais conhecidos - e exclusivos - do mundo. Chamada às pressas por Tyler após o rapaz terminar um relacionamento pouco antes do evento, Margot logo percebe que aquele não é o seu lugar. Lá, a cozinha é liderada pelo famoso chef Slowik (Ralph Fiennes) e estabelecimento fica localizado em uma ilha distante, na qual todos os seus ingredientes frescos são cultivados. Junto de outros clientes autointitulados especiais, como um astro de cinema, funcionários do mercado financeiro, uma crítica gastronômica e um casal milionário, Margot e Tyler entram no bizarro mundo comandado pelo chef Slowik. E o que deveria ser apenas uma noite de degustação de comida especial e bons drinks, no entanto, torna-se um verdadeiro inferno para os convidados, com um cardápio farto, porém algumas surpresas chocantes.",
      "imageUrl": "https://br.web.img3.acsta.net/c_310_420/pictures/22/08/17/22/25/2724945.jpg",
      "trailerUrl": "https://www.youtube.com/watch?v=Jd1rUZz1kd4",
      "minutes": 108,
      "rating": 3.5,
      "favorite": false
    },
    {
      "id": "5",
      "name": "Pânico VI",
      "synopsis": "Sam (Melissa Barrera), Tara (Jenna Ortega), Mindy (Jasmin Savoy Brown) e Chad (Mason Gooding) estão fartos. Depois de sobreviver ao massacre final de Ghostface em Woodsboro, os quatro se mudam sem cerimônia para Nova York. Lá, os dois irmãos querem começar uma nova vida, por assim dizer, e deixar a pequena cidade e suas experiências traumáticas para trás. Mas o maldito assassino com uma máscara de fantasma e uma lâmina afiada não pode ser abalado tão facilmente, porque de repente ele também aparece na Big Apple. Na rua, no metrô, no supermercado – aparentemente em todos os lugares ele aproveita a agitação da cidade grande para desaparecer na multidão com a mesma rapidez com que apareceu antes. E embora Sam, Tara, Mindy e Chad já tenham conhecido o assassino, desta vez eles não podem confiar em sua experiência. Porque quem está por trás da máscara tem novos truques na manga.",
      "imageUrl": "https://br.web.img3.acsta.net/c_310_420/pictures/23/01/19/16/50/3168009.jpg",
      "trailerUrl": "https://www.youtube.com/watch?v=QOgdGhA9gos",
      "minutes": 122,
      "rating": 4,
      "favorite": false
    },
    {
      "id": "6",
      "name": "Missão Impossível 7",
      "synopsis": "Missão Impossível 7: Acerto de Contas Parte 1 é o sétimo capítulo da franquia de ação e espionagem iniciada em 1996, que acompanha o agente norte-americano Ethan Hunt (Tom Cruise) em missões altamente secretas e perigosas. Agora, no novo filme, Ethan e a equipe do IMF formada por Ilsa Faust (Rebecca Ferguson), Benji Dunn (Simon Pegg) e Luther Stickell (Ving Rhames) recebem outra importante missão: eles devem rastrear uma nova e aterrorizante arma que, se cair nas mãos erradas, pode representar uma ameaça para toda a humanidade. Com o controle do futuro e o destino de todo o mundo em jogo, a equipe precisa partir em uma corrida frenética e mortal ao redor do planeta. Além disso, Ethan ainda é confrontado por um novo inimigo misterioso e muito perigoso, e é forçado a aceitar que, para completar o desafio, nada pode importar mais do que a missão - nem mesmo sua própria vida.",
      "imageUrl": "https://ucicinemas.com.br/Content/Upload/Filmes/Posters/9849/filme_9849.jpg",
      "trailerUrl": "https://www.youtube.com/watch?v=YWwoLcMDDC8",
      "minutes": 163,
      "rating": 4.5,
      "favorite": false
    },
    {
      "id": "7",
      "name": "INDIANA JONES E A RELÍQUIA DO DESTINO",
      "synopsis": "Em Indiana Jones e a Relíquia do Destino, Indiana Jones (Harrisson Ford), famoso arqueólogo, professor e aventureiro, embarca em mais uma missão inesperada. Neste retorno do herói lendário, Indiana Jones, na quinta parcela da icônica série de filmes, encontra-se em uma nova era, aproximando-se da aposentadoria. Ele luta para se encaixar em um mundo que parece tê-lo superado. Mas quando as garras de um mal muito familiar retornam na forma de um antigo rival, Indiana Jones deve colocar seu chapéu e pegar seu chicote mais uma vez para garantir que um antigo e poderoso artefato não caia nas mãos erradas. Mas, desta vez, ele tem o sangue de uma nova geração para o ajudar nas suas descobertas e na sua luta contra o vilão Jürgen Voller (Mads Mikkelsen). Acompanhado de sua afilhada, Helena Shaw (Phoebe Waller-Bridge), o arqueólogo corre contra o tempo para recuperar o item que pode mudar o curso da história.",
      "imageUrl": "https://br.web.img3.acsta.net/c_310_420/pictures/23/04/10/17/56/1153346.jpg",
      "trailerUrl": "https://www.youtube.com/watch?v=jBPJyOP3N5U",
      "minutes": 108,
      "rating": 3.4,
      "favorite": false
    },
    {
      "id": "8",
      "name": "Perdida",
      "synopsis": "Adaptação do romance de Carina Rissi, em Perdida acompanhamos a história de Sofia. Determinada e segura de si, Sofia vive na metrópole movimentada do Rio de Janeiro. Ela tem pavor da palavra casamento. Nunca conseguiu se conectar com alguém na vida, apenas com os romances que lê desde sempre. Isso até que um dia compra um celular misterioso que a leva para o século dezenove, no Brasil. Perdida no século, sem saber como e quando voltar para o ano de 2022, ela acaba sendo acolhida pela família Clarke, dona de uma linda e grande propriedade. Com ajuda do lindo e prestativo lorde Ian Clarke, Sofia tenta achar alguma maneira de voltar para sua casa - mas sem antes passar por vários perrengues, como o banheiro da época. Em meio às suas buscas, o que Sofia não esperava era que encontraria seu conto de fadas em um século que não é seu.",
      "imageUrl": "https://br.web.img3.acsta.net/c_310_420/pictures/23/05/12/18/38/3598372.jpg",
      "trailerUrl": "https://www.youtube.com/watch?v=HJndViiTDKc",
      "minutes": 115,
      "rating": 3.3,
      "favorite": false
    }
  ]
}